# Erase Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterMap..::..Erase Method
ParameterMap Class See Also
---
Removes a object with the specified key from the map.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	string key
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	key As String _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	String^ key
)
```

# ### Parameters
key
    Type: System..::..StringThe key of the item to be erased.
# ### Return Value
The number of items that were erased from the map.
# See Also
ParameterMap Class
Autodesk.Revit.DB Namespace